Revit 2024 API
IExtElemChangeBeamSection Interface
 Interface Change Beam section functionality to be implemented in add-ins
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public interface IExtElemChangeBeamSection
Visual Basic
Public Interface IExtElemChangeBeamSection
Visual C++
public interface class IExtElemChangeBeamSection
See Also
IExtElemChangeBeamSection Members
Autodesk.Revit.DB.Structure Namespace